// напишите программу, которая
// на вход принимает число и
// выдаёт его квадрат(умноженное на само себя)

// 4 -> 16
// 3 -> 9
// -7 -> 49

Console.WriteLine("Введие число");
int num = Convert.ToInt32(Console.ReadLine());
int num2 = num * num;
Console.WriteLine(num2);

